Revit 2026 API

# ElementIdSetFilter Constructor

---

Initializes a new instance of the ElementIdSetFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementIdSetFilter(
	ICollection<ElementId> idsToInclude
)
```
```vb
Public Sub New (
	idsToInclude As ICollection(Of ElementId)
)
```
```cpp
public:
ElementIdSetFilter(
	ICollection<ElementId^>^ idsToInclude
)
```
```fsharp
new :
        idsToInclude : ICollection<ElementId> -> ElementIdSetFilter
```

#### Parameters

idsToInclude ICollectionElementId

#### Reference

ElementIdSetFilter Class

Autodesk.Revit.DB Namespace